/*
Γράψτε ένα πρόγραμμα που διαβάζει το κείμενο που 
δίνεται από την πρότυπη είσοδο (stdin) και τυπώνει 
τον κάθε χαρακτήρα στην πρότυπη έξοδο (stdout) σε 
δεκαεξαδική μορφή χωρίζοντάς το σε γραμμές. 
Σε κάθε γραμμή πρέπει να τυπώνονται μέχρι 16 
χαρακτήρες σε δεκαεξαδική μορφή και πρέπει να 
υπάρχει ένας κενός χαρακτήρας (‘ ‘) ανάμεσα σε 
κάθε χαρακτήρα στην ίδια γραμμή.
*/

#include <stdio.h>

int main(){
    int counter=0;
    int temp = getchar();
    while(temp!=EOF){
        printf("%x ", temp);
        counter++;
        if(counter==16){
            counter=0;
            printf("\n");
        }
        temp = getchar();
    }
    return 0;
}